Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
           = 240 -> 4
                                        # (5 unchanged attributes hidden)
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              ~ type            = "timeseries" -> "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "s"
                                      + label   = "seconds"
                                      + logBase = 1
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = false
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                                # (3 unchanged attributes hidden)
                            },
                          ~ {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              ~ datasource      = {
                                  ~ uid  = "${datasource}" -> "${DS_PROMETHEUS}"
                                    # (1 unchanged attribute hidden)
                                }
                              - fieldConfig     = {
                                  - defaults  = {
                                      - color      = {
                                          - mode = "palette-classic"
                                        }
                                      - custom     = {
                                          - axisCenteredZero  = false
                                          - axisColorMode     = "text"
                                          - axisLabel         = "counter"
                                          - axisPlacement     = "auto"
                                          - barAlignment      = 0
                                          - drawStyle         = "line"
                                          - fillOpacity       = 20
                                          - gradientMode      = "none"
                                          - hideFrom          = {
                                              - legend  = false
                                              - tooltip = false
                                              - viz     = false
                                            }
                                          - lineInterpolation = "linear"
                                          - lineStyle         = {
                                              - fill = "solid"
                                            }
                                          - lineWidth         = 1
                                          - pointSize         = 5
                                          - scaleDistribution = {
                                              - type = "linear"
                                            }
                                          - showPoints        = "never"
                                          - spanNulls         = false
                                          - stacking          = {
                                              - group = "A"
                                              - mode  = "none"
                                            }
                                          - thresholdsStyle   = {
                                              - mode = "off"
                                            }
                                        }
                                      - links      = []
                                      - mappings   = []
                                      - thresholds = {
                                          - mode  = "absolute"
                                          - steps = [
                                              - {
                                                  - color = "green"
                                                },
                                              - {
                                                  - color = "red"
                                                  - value = 80
                                                },
                                            ]
                                        }
                                      - unit       = "short"
                                    }
                                  - overrides = [
                                      - {
                                          - matcher    = {
                                              - id      = "byRegexp"
                                              - options = "/.*error.*/"
                                            }
                                          - properties = [
                                              - {
                                                  - id    = "color"
                                                  - value = {
                                                      - fixedColor = "#F2495C"
                                                      - mode       = "fixed"
                                                    }
                                                },
                                              - {
                                                  - id    = "custom.transform"
                                                  - value = "negative-Y"
                                                },
                                            ]
                                        },
                                    ]
                                }
                              + fill            = 2
                              + fillGradient    = 0
                              ~ gridPos         = {
                                  ~ y = 66 -> 54
                                    # (3 unchanged attributes hidden)
                                }
                              + hiddenSeries    = false
                                id              = 157
                              + legend          = {
                                  + alignAsTable = true
                                  + avg          = true
                                  + current      = true
                                  + max          = true
                                  + min          = true
                                  + show         = true
                                  + total        = false
                                  + values       = true
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "null"
                              ~ options         = {
                                  + dataLinks = []
                                  - legend    = {
                                      - calcs       = [
                                          - "mean",
                                          - "lastNotNull",
                                          - "max",
                                          - "min",
                                        ]
                                      - displayMode = "table"
                                      - placement   = "bottom"
                                      - showLegend  = true
                                    }
                                  - tooltip   = {
                                      - mode = "multi"
                                      - sort = "none"
                                    }
                                }
                              + percentage      = false
                              - pluginVersion   = "9.2.0"
                              + pointradius     = 5
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = [
                                  + {
                                      + alias     = "/.*error.*/"
                                      + color     = "#F2495C"
                                      + transform = "negative-Y"
                                    },
                                ]
                              + spaceLength     = 10
                              + stack           = true
                              + steppedLine     = false
                              ~ targets         = [
                                  ~ {
                                      ~ datasource     = {
                                          ~ uid  = "${datasource}" -> "${DS_PROMETHEUS}"
                                            # (1 unchanged attribute hidden)
                                        }
                                      ~ expr           = "node_scrape_collector_success{instance=\"$node\",job=\"$job\"}" -> "node_scrape_collector_success{instance=~\"$node:$port\",job=~\"$job\"}"
                                      ~ intervalFactor = 1 -> 2
                                      ~ step           = 240 -> 4
                                        # (5 unchanged attributes hidden)
                                    },
                                  ~ {
                                      ~ datasource     = {
                                          ~ uid  = "${datasource}" -> "${DS_PROMETHEUS}"
                                            # (1 unchanged attribute hidden)
                                        }
                                      ~ expr           = "node_textfile_scrape_error{instance=\"$node\",job=\"$job\"}" -> "node_textfile_scrape_error{instance=~\"$node:$port\",job=~\"$job\"}"
                                      ~ intervalFactor = 1 -> 2
                                      ~ step           = 240 -> 4
                                        # (5 unchanged attributes hidden)
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              ~ type            = "timeseries" -> "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + label   = "counter"
                                      + logBase = 1
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = false
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                                # (3 unchanged attributes hidden)
                            },
                        ]
                      - targets    = [
                          - {
                              - datasource = {
                                  - type = "prometheus"
                                  - uid  = "000000001"
                                }
                              - refId      = "A"
                            },
                        ]
                        # (4 unchanged attributes hidden)
                    },
                ]
              - revision             = 1
                tags                 = [
                    "linux",
                ]
              ~ templating           = {
                  ~ list = [
                      ~ {
                          ~ current     = {
                              ~ text     = "default" -> "No data sources found"
                              ~ value    = "default" -> ""
                                # (1 unchanged attribute hidden)
                            }
                          ~ label       = "Datasource" -> "datasource"
                          ~ name        = "datasource" -> "DS_Prometheus"
                          ~ query       = "prometheus" -> "Prometheus"
                            # (9 unchanged attributes hidden)
                        },
                      ~ {
                          ~ datasource     = {
                              ~ uid  = "${datasource}" -> "${DS_PROMETHEUS}"
                                # (1 unchanged attribute hidden)
                            }
                            name           = "job"
                            # (16 unchanged attributes hidden)
                        },
                      ~ {
                          ~ datasource     = {
                              ~ uid  = "${datasource}" -> "${DS_PROMETHEUS}"
                                # (1 unchanged attribute hidden)
                            }
                          ~ definition     = "label_values(node_uname_info{job=\"$job\"}, instance)" -> ""
                          ~ label          = "Host" -> "Host:"
                          ~ name           = "node" -> "name"
                          ~ query          = {
                              ~ query = "label_values(node_uname_info{job=\"$job\"}, instance)" -> "label_values(node_uname_info{job=~\"$job\"}, nodename)"
                              ~ refId = "Prometheus-node-Variable-Query" -> "Prometheus-name-Variable-Query"
                            }
                            # (13 unchanged attributes hidden)
                        },
                      ~ {
                          ~ current        = {
                              - selected = false
                              - text     = "[a-z]+|nvme[0-9]+n[0-9]+|mmcblk[0-9]+"
                              - value    = "[a-z]+|nvme[0-9]+n[0-9]+|mmcblk[0-9]+"
                            }
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "${DS_PROMETHEUS}"
                            }
                          + definition     = ""
                          + label          = "Host:"
                          ~ name           = "diskdevices" -> "node"
                          ~ options        = [
                              - {
                                  - selected = true
                                  - text     = "[a-z]+|nvme[0-9]+n[0-9]+|mmcblk[0-9]+"
                                  - value    = "[a-z]+|nvme[0-9]+n[0-9]+|mmcblk[0-9]+"
                                },
                            ]
                          ~ query          = "[a-z]+|nvme[0-9]+n[0-9]+|mmcblk[0-9]+" -> {
                              + query = "label_values(node_uname_info{nodename=\"$name\"}, instance)"
                              + refId = "Prometheus-node-Variable-Query"
                            }
                          + refresh        = 1
                          + regex          = "/([^:]+):.*/"
                          + sort           = 1
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          ~ type           = "custom" -> "query"
                          + useTags        = false
                            # (4 unchanged attributes hidden)
                        },
                      + {
                          + current        = {}
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "${DS_PROMETHEUS}"
                            }
                          + definition     = ""
                          + hide           = 0
                          + includeAll     = false
                          + label          = "Port"
                          + multi          = false
                          + name           = "port"
                          + options        = []
                          + query          = {
                              + query = "label_values(node_uname_info{instance=~\"$node:(.*)\"}, instance)"
                              + refId = "Prometheus-port-Variable-Query"
                            }
                          + refresh        = 1
                          + regex          = "/[^:]+:(.*)/"
                          + skipUrlSync    = false
                          + sort           = 3
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                    ]
                }
                # (13 unchanged attributes hidden)
            }
        )
      ~ dashboard_id = 6 -> (known after apply)
      + folder       = "0:1" # forces replacement
      ~ id           = "0:rYdddlPWk" -> (known after apply)
      - org_id       = "0" -> null
      ~ uid          = "rYdddlPWk" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/rYdddlPWk/node-exporter-full" -> (known after apply)
      ~ version      = 5 -> (known after apply)
    }

  # grafana_data_source.todoist-projects will be created
+ resource "grafana_data_source" "todoist-projects" {
      + access_mode              = "proxy"
      + basic_auth_enabled       = false
      + id                       = (known after apply)
      + is_default               = false
      + json_data_encoded        = jsonencode(
            {
              + auth_method = "bearerToken"
            }
        )
      + name                     = "todoist-projects"
      + secure_json_data_encoded = (sensitive value)
      + type                     = "yesoreyeram-infinity-datasource"
      + uid                      = (known after apply)
      + url                      = "https://api.todoist.com/rest/v2/projects"
    }

  # grafana_data_source.todoist-tasks will be created
+ resource "grafana_data_source" "todoist-tasks" {
      + access_mode              = "proxy"
      + basic_auth_enabled       = false
      + id                       = (known after apply)
      + is_default               = false
      + json_data_encoded        = jsonencode(
            {
              + auth_method = "bearerToken"
            }
        )
      + name                     = "todoist-tasks"
      + secure_json_data_encoded = (sensitive value)
      + type                     = "yesoreyeram-infinity-datasource"
      + uid                      = (known after apply)
      + url                      = "https://api.todoist.com/rest/v2/tasks"
    }

  # grafana_data_source.victorialogs will be created
+ resource "grafana_data_source" "victorialogs" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "VictoriaLogs"
      + type               = "victoriametrics-logs-datasource"
      + uid                = (known after apply)
      + url                = "http://victorialogs-svc.logs:9428"
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p grafana`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgrafana%252Fgrafana)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p grafana`
</details>
Plan: 4 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`